
<!-- 
1. friend_list.csv 파일을 불러와서 상위5개만 출력해 보세요.
2. friend_list.txt 파일을 불러와서 상위 5개만 출력해 보세요.
3. friend_list_tab.txt 파일을 불러와서 상위 5개만 출력해 보세요.
4. 헤더가 없는 friend_list_no_head.csv 파일의
첫번째 데이터가 헤더로 들어가지 않도록 불러와 보세요.
5.아래와 같은 데이터프레임을 만들어 보세요.
	name	age	job
------------------------------------
0	John	20	student
1	Jenny	30	developer
2	Nate	30	teacher
6. 5.에서 만든 데이터프레임을  new_friend.csv파일로 저장해 보세요.
7. 1부터 3까지 행(row)을 출력해 보세요.(순차적 선택)
8. 0, 2번 행(row)을 선택해서 출력해 보세요.(순차적이지 않은 row 선택)
9.
모든 행(row)을 보여주되, 열(column)은 0부터 1까지만 출력
10.
모든 행(row)을 보여주되, 열(column) 0와 2만 출 출력
11. 데이터프레임에서 'name'과 'age' 열만 출력해 보세요.
 -->

<!-- 
1. friend_list.csv 파일을 불러와서 상위5개만 출력해 보세요.
2. friend_list.txt 파일을 불러와서 상위 5개만 출력해 보세요.
3. friend_list_tab.txt 파일을 불러와서 상위 5개만 출력해 보세요.
4. 헤더가 없는 friend_list_no_head.csv 파일의
첫번째 데이터가 헤더로 들어가지 않도록 불러와 보세요.
5.아래와 같은 데이터프레임을 만들어 보세요.
	name	age	job
------------------------------------
0	John	20	student
1	Jenny	30	developer
2	Nate	30	teacher
6. 1부터 3까지 행(row)을 출력해 보세요.(순차적 선택)
7. 0, 2번 행(row)을 선택해서 출력해 보세요.(순차적이지 않은 row 선택)
8.모든 행(row)을 보여주되, 열(column)은 0부터 1까지만 출력
9.모든 행(row)을 보여주되, 열(column) 0와 2만 출 출력
10. 데이터프레임에서 'name'과 'age' 열만 출력해 보세요.
 -->

In [1]:
import pandas as pd

<b>1. friend_list.csv 파일을 불러와서 상위5개만 출력해 보세요.</b>

In [3]:
friend_c = pd.read_csv('../data/python_data/friend_list.csv', sep = ',')
friend_c

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [4]:
friend_c.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

<b>2. friend_list.txt 파일을 불러와서 상위 5개만 출력해 보세요.</b>

In [6]:
friend_comma = pd.read_csv('../data/python_data/friend_list.txt', sep = ',')
friend_comma

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [7]:
friend_comma.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

<b>3. friend_list_tab.txt 파일을 불러와서 상위 5개만 출력해 보세요. </b>

In [8]:
friend_tab = pd.read_csv('../data/python_data/friend_list.txt', sep = '\t')
friend_tab

         name,age,job
0     John,20,student
1  Jenny,30,developer
2     Nate,30,teacher
3    Julia,40,dentist
4    Brian,45,manager
5     Chris,25,intern

In [10]:
friend_tab.head()

         name,age,job
0     John,20,student
1  Jenny,30,developer
2     Nate,30,teacher
3    Julia,40,dentist
4    Brian,45,manager

<b> 4. 헤더가 없는 friend_list_no_head.csv 파일의 첫번째 데이터가 헤더로 들어가지 않도록 불러와 보세요.</b>

In [17]:
df = pd.read_csv('../data/python_data/friend_list_no_head.csv', header=None)  #default는 header=y

In [18]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

<5.아래와 같은 데이터프레임을 만들어 보세요.

	name	age	job
------------------------------------
0	John	20	student
1	Jenny	30	developer
2	Nate	30	teacher

In [ ]:
# 전체 열 이름 입력하기
# df.columns = ['col', 'col', 'col']

# 선택하여 열 이름 변경하기
# df.rename(columns={'Before':'After'})

In [22]:
df.columns = ['name', 'age', 'job']

In [23]:
df.columns

Index(['name', 'age', 'job'], dtype='object')

In [24]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

<b>6. 1부터 3까지 행(row)을 출력해 보세요.(순차적 선택)</b>

In [26]:
df.loc[:2,:]      #1행부터 3행까지

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

<b>7. 0, 2번 행(row)을 선택해서 출력해 보세요.(순차적이지 않은 row 선택)</b>

In [27]:
df.loc[[0,2],:]

   name  age      job
0  John   20  student
2  Nate   30  teacher

<b>8.모든 행(row)을 보여주되, 열(column)은 0부터 1까지만 출력</b>

In [37]:
df.iloc[:, 0:1]

    name
0   John
1  Jenny
2   Nate
3  Julia
4  Brian
5  Chris

<b>9.모든 행(row)을 보여주되, 열(column) 0와 2만 출 출력</b>

In [39]:
df.iloc[:, [0,2]]

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher
3  Julia    dentist
4  Brian    manager
5  Chris     intern

<b>10. 데이터프레임에서 'name'과 'age' 열만 출력해 보세요.</b>

In [40]:
df.loc[:,['name','age']]

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25